In [1]:
import numpy as np
import pandas as pd

In [24]:
 np.random.randn(5,4)

array([[ 1.49505714,  0.33651209, -1.00485773, -1.36286257],
       [-0.20952891, -0.83685963, -0.45456386, -1.61356083],
       [ 0.81597931,  1.00277213, -0.54619239, -0.05950476],
       [-0.22176175, -0.1702631 , -0.78071119, -0.20306884],
       [-0.52490041, -1.59318178,  0.14826228,  0.72271897]])

In [27]:
df=pd.DataFrame(np.random.rand(4,4))

In [33]:
df

         sername    number     email       age
daksh   0.638710  0.340542  0.203037  0.939839
nitu    0.888622  0.301744  0.438157  0.917145
shruti  0.254134  0.352758  0.659730  0.319155

In [39]:
arr=[['verma','7015854780','daksh@gmail',18],['verma','9896634469','nitu@gmail',25],['verma','8295048168','shruti@gmail',19]]

In [40]:
df=pd.DataFrame(arr,['daksh','nitu','shruti'],['sername','number','email','age'])

In [41]:
df

       sername      number         email  age
daksh    verma  7015854780   daksh@gmail   18
nitu     verma  9896634469    nitu@gmail   25
shruti   verma  8295048168  shruti@gmail   19

In [47]:
df[df['age']>20]['number']  # that row in which age >20 ka number

nitu    9896634469
Name: number, dtype: object

In [49]:
 type(df['number']) # series

pandas.core.series.Series

In [50]:
df[['number','email']]

            number         email
daksh   7015854780   daksh@gmail
nitu    9896634469    nitu@gmail
shruti  8295048168  shruti@gmail

In [51]:
df['gender']=['m','f','f']

In [52]:
df

       sername      number         email  age gender
daksh    verma  7015854780   daksh@gmail   18      m
nitu     verma  9896634469    nitu@gmail   25      f
shruti   verma  8295048168  shruti@gmail   19      f

In [56]:
df.drop("sername",axis=1)

            number         email  age gender
daksh   7015854780   daksh@gmail   18      m
nitu    9896634469    nitu@gmail   25      f
shruti  8295048168  shruti@gmail   19      f

In [57]:
df

       sername      number         email  age gender
daksh    verma  7015854780   daksh@gmail   18      m
nitu     verma  9896634469    nitu@gmail   25      f
shruti   verma  8295048168  shruti@gmail   19      f

In [58]:
df.drop("sername",axis=1,inplace=True)

In [59]:
df

            number         email  age gender
daksh   7015854780   daksh@gmail   18      m
nitu    9896634469    nitu@gmail   25      f
shruti  8295048168  shruti@gmail   19      f

In [60]:
 df.drop("daksh")

            number         email  age gender
nitu    9896634469    nitu@gmail   25      f
shruti  8295048168  shruti@gmail   19      f

In [61]:
df.shape

(3, 4)

In [62]:
#  rows

In [63]:
df.loc['daksh']

number     7015854780
email     daksh@gmail
age                18
gender              m
Name: daksh, dtype: object

In [64]:
df.loc[['daksh'],['number']]

           number
daksh  7015854780

In [67]:
df[df.loc[['daksh'],['age']]>0]

       number email   age gender
daksh     NaN   NaN  18.0    NaN
nitu      NaN   NaN   NaN    NaN
shruti    NaN   NaN   NaN    NaN

In [69]:
df.loc[['nitu','shruti'],'number']

nitu      9896634469
shruti    8295048168
Name: number, dtype: object

part 2

In [71]:
# df>0 error

In [72]:
df[df['age']>19]

          number       email  age gender
nitu  9896634469  nitu@gmail   25      f

In [77]:
 df[df.loc[['daksh'],['email']]=="daksh@gmail"] # if row is included in conditioning then Nan comes 
    # if only column is present then whole row will be printed

       number        email  age gender
daksh     NaN  daksh@gmail  NaN    NaN
nitu      NaN          NaN  NaN    NaN
shruti    NaN          NaN  NaN    NaN

In [82]:
df[(df['age']>=18) & (df['number']=='7015854780')]

           number        email  age gender
daksh  7015854780  daksh@gmail   18      m

In [83]:
# either a female or male of age <18

In [86]:
df[(df['gender']=='f') | (df['age']<18)]

            number         email  age gender
nitu    9896634469    nitu@gmail   25      f
shruti  8295048168  shruti@gmail   19      f

 reset index

In [88]:
df2=df.reset_index()

##

In [89]:
df2

    index      number         email  age gender
0   daksh  7015854780   daksh@gmail   18      m
1    nitu  9896634469    nitu@gmail   25      f
2  shruti  8295048168  shruti@gmail   19      f

In [90]:
df2['index']

0     daksh
1      nitu
2    shruti
Name: index, dtype: object

In [93]:
df2["first_letter"]=['d','n','s']

In [94]:
df2

    index      number         email  age gender first_letter
0   daksh  7015854780   daksh@gmail   18      m            d
1    nitu  9896634469    nitu@gmail   25      f            n
2  shruti  8295048168  shruti@gmail   19      f            s

In [95]:
df2.reset_index()

   level_0   index      number         email  age gender first_letter
0        0   daksh  7015854780   daksh@gmail   18      m            d
1        1    nitu  9896634469    nitu@gmail   25      f            n
2        2  shruti  8295048168  shruti@gmail   19      f            s

In [97]:
df3=df2.reset_index()

In [101]:
df2

    index      number         email  age gender first_letter
0   daksh  7015854780   daksh@gmail   18      m            d
1    nitu  9896634469    nitu@gmail   25      f            n
2  shruti  8295048168  shruti@gmail   19      f            s

In [113]:
df2.set_index('first_letter',inplace=True) # old indexes gets deleted

In [118]:
# df2['first_letter'] ERROR

In [115]:
df2["number"]

first_letter
d    7015854780
n    9896634469
s    8295048168
Name: number, dtype: object

In [116]:
df2.loc['d']

index           daksh
number     7015854780
email     daksh@gmail
age                18
gender              m
Name: d, dtype: object